In [1]:
import pandas as pd

In [2]:
population = pd.Series([9668465,3391946,2942828,1450062],
                       index = ['서울','부산','인천','광주'])
population

서울    9668465
부산    3391946
인천    2942828
광주    1450062
dtype: int64

In [3]:
print(population.index)
print(population.dtype)
population.values

Index(['서울', '부산', '인천', '광주'], dtype='object')
int64

array([9668465, 3391946, 2942828, 1450062], dtype=int64)

In [4]:
population.name = '인구'
population.index.name = '도시'
population

도시
서울    9668465
부산    3391946
인천    2942828
광주    1450062
Name: 인구, dtype: int64

In [5]:
population/10000

도시
서울    966.8465
부산    339.1946
인천    294.2828
광주    145.0062
Name: 인구, dtype: float64

In [6]:
population[1],population['부산']

(3391946, 3391946)

In [7]:
population[[0,3,1]]

도시
서울    9668465
광주    1450062
부산    3391946
Name: 인구, dtype: int64

In [8]:
population[['서울','광주','부산']]

도시
서울    9668465
광주    1450062
부산    3391946
Name: 인구, dtype: int64

In [9]:
population > 2000000

도시
서울     True
부산     True
인천     True
광주    False
Name: 인구, dtype: bool

In [10]:
population[population > 2000000]

도시
서울    9668465
부산    3391946
인천    2942828
Name: 인구, dtype: int64

In [11]:
print(population[population >= 3000000])
print(population[(population <= 5000000) & (population >= 2500000)])

도시
서울    9668465
부산    3391946
Name: 인구, dtype: int64
도시
부산    3391946
인천    2942828
Name: 인구, dtype: int64

In [12]:
population[1:3]

도시
부산    3391946
인천    2942828
Name: 인구, dtype: int64

In [13]:
population['부산':'인천']

도시
부산    3391946
인천    2942828
Name: 인구, dtype: int64

In [14]:
data = {'피카츄' : 9631, '꼬부기' : 3393, '파이리' : 1490, '이상해씨' : 2632}
pokemon = pd.Series(data)
pokemon

피카츄     9631
꼬부기     3393
파이리     1490
이상해씨    2632
dtype: int64

In [15]:
data2 = {'피카츄' : 9904, '꼬부기' : 3448, '이브이' : 2466, '뮤' : 2890}
pokemon_up = pd.Series(data2)
pokemon_up

피카츄    9904
꼬부기    3448
이브이    2466
뮤      2890
dtype: int64

In [16]:
attack = pokemon_up - pokemon
attack.notnull()

꼬부기      True
뮤       False
이브이     False
이상해씨    False
파이리     False
피카츄      True
dtype: bool

In [17]:
print(attack[attack.notnull()])
attack.dropna()

꼬부기     55.0
피카츄    273.0
dtype: float64

꼬부기     55.0
피카츄    273.0
dtype: float64

In [18]:
rp = ((pokemon_up - pokemon) / pokemon) *100
rp.dropna()

꼬부기    1.620984
피카츄    2.834597
dtype: float64

In [19]:
print(attack)
attack['파이리'] = 1616
attack['리자몽'] = 8888
del attack['이상해씨']
attack

꼬부기      55.0
뮤         NaN
이브이       NaN
이상해씨      NaN
파이리       NaN
피카츄     273.0
dtype: float64

꼬부기      55.0
뮤         NaN
이브이       NaN
파이리    1616.0
피카츄     273.0
리자몽    8888.0
dtype: float64

In [20]:
print(attack.isnull())
attack[attack.isnull()]

꼬부기    False
뮤       True
이브이     True
파이리    False
피카츄    False
리자몽    False
dtype: bool

뮤     NaN
이브이   NaN
dtype: float64

In [21]:
data = {'2020' : [9668465, 3391946, 2942828, 1450062],
        '2010' : [10312545, 3567910, 2758296, 1454636]}
df = pd.DataFrame(data, index = ['서울','부산','인천','광주'])
# df.index = ['서울','부산','인천','광주']
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [22]:
# 인덱스 지정 DafaFrame 생성
data2 = [[9668465, 3391946, 2942828, 1450062],
         [10312545, 3567910, 2758296, 1454636]]
ind = ['2020', '2010']
col = ['서울','부산','인천','광주']
df2 = pd.DataFrame(data2, index= ind, columns = col)
df2

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

In [23]:
print(df.values, df.index, df.columns)

[[ 9668465 10312545]
 [ 3391946  3567910]
 [ 2942828  2758296]
 [ 1450062  1454636]] Index(['서울', '부산', '인천', '광주'], dtype='object') Index(['2020', '2010'], dtype='object')

In [24]:
df['2020'] # 열 인덱싱

서울    9668465
부산    3391946
인천    2942828
광주    1450062
Name: 2020, dtype: int64

In [25]:
df[['2020']]

       2020
서울  9668465
부산  3391946
인천  2942828
광주  1450062

In [26]:
df[['2020','2010']]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [27]:
df['2005'] = [9762546, 3512547, 2517680, 1456016]
df

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680
광주  1450062   1454636  1456016

In [28]:
df[0:2] # 행 슬라이싱

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

In [29]:
df['서울':'부산']

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

In [30]:
# loc[] 인덱서 인덱스 이름을 사용하여 행을 가져옴
df.loc['부산':'인천','2020':'2010']

       2020     2010
부산  3391946  3567910
인천  2942828  2758296

In [31]:
# iloc[] 인덱서 numppy의 array 인덱싱 방식으로 행을 가져옴 (인덱스의 번호를 취급)
df.iloc[3]

2020    1450062
2010    1454636
2005    1456016
Name: 광주, dtype: int64

In [32]:
df['2010'] >= 2500000

서울     True
부산     True
인천     True
광주    False
Name: 2010, dtype: bool

In [33]:
df[df['2010'] >= 2500000]

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680

In [34]:
df.T #전치

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636
2005   9762546  3512547  2517680  1456016

In [35]:
population=pd.read_csv("population.csv",encoding="cp949")
population

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [36]:
population=pd.read_csv("population.csv", index_col='도시', encoding="cp949")
population

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [37]:
population.sort_index() # 인덱스 정렬

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

In [38]:
population['2010'].sort_values() # 데이터 값 정렬

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [39]:
population['2010'].sort_values(ascending = False) # 내림차순

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [40]:
population.sort_values(by='2010') # 2010 열을 기준으로 정렬

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

In [41]:
population.sort_values(by= ['지역','2015'])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [42]:
score=pd.read_csv("score.csv",index_col = '과목', encoding="cp949")
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [43]:
score.sum().iloc[0:4]

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [44]:
score.sum().iloc[0:4].sort_values(ascending = False)
score.sum().sort_values(ascending = False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [45]:
score.sum(axis=1) # 행의 총합

과목
파이썬    201
DB     282
자바     253
크롤링    298
Web    163
dtype: int64

In [46]:
score['합계'] = score.sum(axis=1)
score

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

In [47]:
score['평균'] = score.loc[:,:'4반'].mean(axis=1)
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

In [48]:
score.max()

1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64

In [49]:
score.min()

1반     11.00
2반     44.00
3반     45.00
4반     26.00
합계    163.00
평균     40.75
dtype: float64

In [50]:
score.max(axis=1) # 행중 가장큰 값

과목
파이썬    201.0
DB     282.0
자바     253.0
크롤링    298.0
Web    163.0
dtype: float64

In [51]:
score.min(axis=1)

과목
파이썬    39.0
DB     45.0
자바     45.0
크롤링    40.0
Web    11.0
dtype: float64

In [52]:
amax =score.loc[:'Web',:'4반'].max(axis=1) 
amax

과목
파이썬    73
DB     92
자바     92
크롤링    92
Web    79
dtype: int64

In [53]:
amin = score.loc[:'Web',:'4반'].min(axis=1)
amin

과목
파이썬    39
DB     45
자바     45
크롤링    40
Web    11
dtype: int64

In [54]:
print(amax-amin)

과목
파이썬    34
DB     47
자바     47
크롤링    52
Web    68
dtype: int64

In [55]:
score=pd.read_csv("score.csv",index_col = '과목', encoding="cp949")

score = score.drop('1반', axis=1) # 각 행에서 1반 열값을 삭제
score.drop('DB', axis=0)

     2반  3반  4반
과목
파이썬  44  73  39
자바   92  45  69
크롤링  81  85  40
Web  79  47  26

In [56]:
data_dic = {'A' : [1,3,3,4,4], 'B' : [1,2,2,3,3], 'C' : [1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [57]:
df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [58]:
df4.fillna(0) # NaN 를 원하는 값으로 바꾸는 기능

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [59]:
ages = [0,2,10,21,23,37,31,61,20,41,32,100]
bins = [0,15,25,35,60,99] # 구간 설정
labels = ["미성년자","청년","중년","장년","노년"]
cats=pd.cut(ages,bins,labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [60]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [61]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [62]:
ageArr = pd.DataFrame(ages, columns=['ages'])
ageArr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

In [63]:
ageArr['age_cat'] = cats
ageArr

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

In [65]:
ageArr['age_cat'].value_counts()

청년      3
미성년자    2
중년      2
장년      2
노년      1
Name: age_cat, dtype: int64

In [79]:
df1 = pd.DataFrame({'A' : ['A0','A1','A2','A3'],
                    'B' : ['B0','B1','B2','B3'],
                    'C' : ['C0','C1','C2','C3'],
                    'D' : ['D0','D1','D2','D3']},
                   index=[0,1,2,3])
df2 = pd.DataFrame({'A' : ['A4','A5','A6','A7'],
                    'B' : ['B4','B5','B6','B7'],
                    'C' : ['C4','C5','C6','C7'],
                    'D' : ['D4','D5','D6','D7']},
                   index=[4,5,6,7])
df3 = pd.DataFrame({'A' : ['A8','A9','A10','A11'],
                    'B' : ['B8','B9','B10','B11'],
                    'C' : ['C8','C9','C10','C11'],
                    'D' : ['D8','D9','D10','D11']},
                   index=[8,9,10,11])

In [69]:
# 병합
result = pd.concat([df1,df2,df3], keys = ['x','y','z']) # key 속성 부여시 다중 index가됨
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [71]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [73]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [82]:
# 행 방향 병합
df4 = pd.DataFrame({'B' : ['B2','B3','B6','B7'],
                    'D' : ['D2','D3','D6','D7'],
                    'F' : ['F2','F3','F6','F7']},
                   index=[2,3,6,7])
result = pd.concat([df1,df4], axis=1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [84]:
df4 = pd.DataFrame({'B' : ['B2','B3','B6','B7'],
                    'D' : ['D2','D3','D6','D7'],
                    'F' : ['F2','F3','F6','F7']},
                   index=[2,3,6,7])
result = pd.concat([df1,df4], axis=0)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [87]:
result = pd.concat([df1,df4], axis =1, join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [89]:
result = pd.concat([df1,df4], axis =0, join='inner')
result

    B   D
0  B0  D0
1  B1  D1
2  B2  D2
3  B3  D3
2  B2  D2
3  B3  D3
6  B6  D6
7  B7  D7

In [90]:
# 기존의 인덱스를 무시하고 새로운 인덱스를 부여
result = pd.concat([df1,df4], ignore_index = True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7